; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph0 - mode
	infrared2 - mode
	image1 - mode
	image4 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Planet24 - direction
	Phenomenon25 - direction
	Planet26 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image4)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon18)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star22)
	(supports instrument6 image4)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon21)
	(supports instrument7 image1)
	(supports instrument7 infrared3)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star3)
	(supports instrument8 infrared3)
	(supports instrument8 image4)
	(supports instrument8 image1)
	(calibration_target instrument8 Star1)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon25)
)
(:goal (and
	(pointing satellite3 Phenomenon18)
	(have_image Phenomenon4 infrared3)
	(have_image Planet5 image1)
	(have_image Planet6 spectrograph0)
	(have_image Planet7 image4)
	(have_image Star8 image1)
	(have_image Planet9 spectrograph0)
	(have_image Star10 infrared2)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 infrared3)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 infrared3)
	(have_image Planet15 spectrograph0)
	(have_image Planet17 spectrograph0)
	(have_image Star19 infrared2)
	(have_image Phenomenon20 image4)
	(have_image Phenomenon21 image1)
	(have_image Star22 spectrograph0)
	(have_image Planet24 spectrograph0)
	(have_image Phenomenon25 image1)
	(have_image Planet26 image4)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 21
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 21
3. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 21
4. (turn_to satellite4 star3 phenomenon25)
   deleted: (pointing satellite4 phenomenon25)
   added: (pointing satellite4 star3)
   goals met: 0 of 21
5. (calibrate satellite4 instrument7 star3)
   added: (calibrated instrument7)
   goals met: 0 of 21
6. (turn_to satellite4 phenomenon14 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 21
7. (take_image satellite4 phenomenon14 instrument7 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 1 of 21
8. (turn_to satellite4 phenomenon21 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon21)
   goals met: 1 of 21
9. (take_image satellite4 phenomenon21 instrument7 image1)
   added: (have_image phenomenon21 image1)
   goals met: 2 of 21
10. (turn_to satellite4 phenomenon25 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon25)
   goals met: 2 of 21
11. (take_image satellite4 phenomenon25 instrument7 image1)
   added: (have_image phenomenon25 image1)
   goals met: 3 of 21
12. (turn_to satellite4 phenomenon4 phenomenon25)
   deleted: (pointing satellite4 phenomenon25)
   added: (pointing satellite4 phenomenon4)
   goals met: 3 of 21
13. (take_image satellite4 phenomenon4 instrument7 infrared3)
   added: (have_image phenomenon4 infrared3)
   goals met: 4 of 21
14. (turn_to satellite4 planet12 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 planet12)
   goals met: 4 of 21
15. (take_image satellite4 planet12 instrument7 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 5 of 21
16. (turn_to satellite4 planet5 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet5)
   goals met: 5 of 21
17. (take_image satellite4 planet5 instrument7 image1)
   added: (have_image planet5 image1)
   goals met: 6 of 21
18. (turn_to satellite4 star10 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star10)
   goals met: 6 of 21
19. (take_image satellite4 star10 instrument7 infrared2)
   added: (have_image star10 infrared2)
   goals met: 7 of 21
20. (turn_to satellite4 star13 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star13)
   goals met: 7 of 21
21. (take_image satellite4 star13 instrument7 infrared3)
   added: (have_image star13 infrared3)
   goals met: 8 of 21
22. (turn_to satellite4 star19 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star19)
   goals met: 8 of 21
23. (take_image satellite4 star19 instrument7 infrared2)
   added: (have_image star19 infrared2)
   goals met: 9 of 21
24. (turn_to satellite4 star8 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star8)
   goals met: 9 of 21
25. (take_image satellite4 star8 instrument7 image1)
   added: (have_image star8 image1)
   goals met: 10 of 21
26. (turn_to satellite3 phenomenon18 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 phenomenon18)
   goals met: 11 of 21
27. (turn_to satellite3 star1 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 star1)
   goals met: 10 of 21
28. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 10 of 21
29. (turn_to satellite3 phenomenon18 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon18)
   goals met: 11 of 21
30. (turn_to satellite3 phenomenon20 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 phenomenon20)
   goals met: 10 of 21
31. (take_image satellite3 phenomenon20 instrument6 image4)
   added: (have_image phenomenon20 image4)
   goals met: 11 of 21
32. (turn_to satellite3 phenomenon18 phenomenon20)
   deleted: (pointing satellite3 phenomenon20)
   added: (pointing satellite3 phenomenon18)
   goals met: 12 of 21
33. (turn_to satellite3 planet11 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet11)
   goals met: 11 of 21
34. (take_image satellite3 planet11 instrument6 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 12 of 21
35. (turn_to satellite3 phenomenon18 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon18)
   goals met: 13 of 21
36. (turn_to satellite3 planet15 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet15)
   goals met: 12 of 21
37. (take_image satellite3 planet15 instrument6 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 13 of 21
38. (turn_to satellite3 phenomenon18 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 phenomenon18)
   goals met: 14 of 21
39. (turn_to satellite3 planet17 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet17)
   goals met: 13 of 21
40. (take_image satellite3 planet17 instrument6 spectrograph0)
   added: (have_image planet17 spectrograph0)
   goals met: 14 of 21
41. (turn_to satellite3 phenomenon18 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 phenomenon18)
   goals met: 15 of 21
42. (turn_to satellite3 planet24 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet24)
   goals met: 14 of 21
43. (take_image satellite3 planet24 instrument6 spectrograph0)
   added: (have_image planet24 spectrograph0)
   goals met: 15 of 21
44. (turn_to satellite3 phenomenon18 planet24)
   deleted: (pointing satellite3 planet24)
   added: (pointing satellite3 phenomenon18)
   goals met: 16 of 21
45. (turn_to satellite3 planet26 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet26)
   goals met: 15 of 21
46. (take_image satellite3 planet26 instrument6 image4)
   added: (have_image planet26 image4)
   goals met: 16 of 21
47. (turn_to satellite3 phenomenon18 planet26)
   deleted: (pointing satellite3 planet26)
   added: (pointing satellite3 phenomenon18)
   goals met: 17 of 21
48. (turn_to satellite3 planet6 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet6)
   goals met: 16 of 21
49. (take_image satellite3 planet6 instrument6 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 17 of 21
50. (turn_to satellite3 phenomenon18 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon18)
   goals met: 18 of 21
51. (turn_to satellite3 planet7 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet7)
   goals met: 17 of 21
52. (take_image satellite3 planet7 instrument6 image4)
   added: (have_image planet7 image4)
   goals met: 18 of 21
53. (turn_to satellite3 phenomenon18 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 phenomenon18)
   goals met: 19 of 21
54. (turn_to satellite3 planet9 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 planet9)
   goals met: 18 of 21
55. (take_image satellite3 planet9 instrument6 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 19 of 21
56. (turn_to satellite3 phenomenon18 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 phenomenon18)
   goals met: 20 of 21
57. (turn_to satellite3 star22 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 star22)
   goals met: 19 of 21
58. (take_image satellite3 star22 instrument6 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 20 of 21
59. (turn_to satellite3 phenomenon18 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 phenomenon18)
   goals met: 21 of 21
